package com.nexzenapk.techfeed;

import androidx.appcompat.app.AppCompatActivity;

import android.annotation.SuppressLint;
import android.content.Context;
import android.content.Intent;
import android.graphics.Bitmap;
import android.graphics.drawable.BitmapDrawable;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.ListView;
import android.widget.TextView;
import android.widget.Toast;

import com.squareup.picasso.Picasso;

import java.util.ArrayList;
import java.util.HashMap;


public class MainActivity extends AppCompatActivity {

    LayoutInflater layoutInflater;
    ListView listView;

    HashMap <String,String> hashMap ;
    ArrayList <HashMap <String,String> > arrayList = new ArrayList<>();

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        meta_data();


        listView = findViewById(R.id.listView);
        MyAdapter myAdapter = new MyAdapter();
        listView.setAdapter(myAdapter);





    }
    ///////////////////////////////////////////////
    ////////////////Create MyAdapter //////////////
    ///////////////////////////////////////////////
    public  class MyAdapter extends BaseAdapter{

        LinearLayout btn;


        @Override
        public int getCount() {
            return arrayList.size();
        }

        @Override
        public Object getItem(int i) {
            return null;
        }

        @Override
        public long getItemId(int i) {
            return 0;
        }

        @SuppressLint("MissingInflatedId")
        @Override
        public View getView(int possion, View view, ViewGroup viewGroup) {

            layoutInflater = (LayoutInflater) getSystemService(Context.LAYOUT_INFLATER_SERVICE);
            View myView = layoutInflater.inflate(R.layout.activity_feed,viewGroup,false);

            HashMap <String,String> hashMap = arrayList.get(possion);

            String stitle = hashMap.get("title");
            String sdes = hashMap.get("des");
            String image_url = hashMap.get("image_url");

            TextView iTitle = myView.findViewById(R.id.textTitle);
            TextView ides = myView.findViewById(R.id.textDes);
            ImageView banner = myView.findViewById(R.id.banner);
            btn= myView.findViewById(R.id.newsbtn);
            ImageView itemMore = myView.findViewById(R.id.itemMore);
            ImageView itemSave = myView.findViewById(R.id.itemSave);


            itemMore.setOnClickListener(new View.OnClickListener() {
                @Override
                public void onClick(View view) {

                    Toast.makeText(MainActivity.this,"more "+stitle,Toast.LENGTH_LONG).show();

                }
            });

            itemSave.setOnClickListener(new View.OnClickListener() {
                @Override
                public void onClick(View view) {

                    Toast.makeText(MainActivity.this,"save "+stitle,Toast.LENGTH_LONG).show();



                }
            });




            iTitle.setText(stitle);
            ides.setText(sdes);

            Picasso.get()
                    .load(image_url)
                    .placeholder(R.drawable.nimage)
                    .into(banner);

            btn.setOnClickListener(new View.OnClickListener() {
                @Override
                public void onClick(View view) {

                    Intent intent = new Intent(MainActivity.this,MainActivity2.class);
                    startActivity(intent);
                    Toast.makeText(MainActivity.this,""+stitle,Toast.LENGTH_LONG).show();
                    MainActivity2.news_Title=stitle;
                    MainActivity2.news_des=sdes;

                    Bitmap bitmap = ((BitmapDrawable)banner.getDrawable()).getBitmap();
                    MainActivity2.news_Banner=bitmap;




                }
            });



            return myView;
        }
    }

    ///////////////////////////////////////////////
    ////////////////Create DataBase ///////////////
    ///////////////////////////////////////////////

    public void meta_data(){


        hashMap = new HashMap<>();
        hashMap.put("title","স্যামসাংয়ের এই ফোনে ৫০ মেগাপিক্সেলের ক্যামেরা আছে");
        hashMap.put("image_url","https://techzoom.tv/wp-content/uploads/2023/08/%E0%A6%B8%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%AE%E0%A6%B8%E0%A6%BE%E0%A6%82%E0%A7%9F%E0%A7%87%E0%A6%B0-%E0%A6%8F%E0%A6%87-%E0%A6%AB%E0%A7%8B%E0%A6%A8%E0%A7%87-%E0%A7%AB%E0%A7%A6-%E0%A6%AE%E0%A7%87%E0%A6%97%E0%A6%BE%E0%A6%AA%E0%A6%BF%E0%A6%95%E0%A7%8D%E0%A6%B8%E0%A7%87%E0%A6%B2%E0%A7%87%E0%A6%B0-%E0%A6%95%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%AE%E0%A7%87%E0%A6%B0%E0%A6%BE-%E0%A6%86%E0%A6%9B%E0%A7%87.jpg");
        hashMap.put("des","৫০ মেগাপিক্সেল ক্যামেরার ফোন আনল স্যামসাং। মডেল স্যামসাং গ্যালাক্সি এ৩৪। হ্যান্ডসেটটিতে শক্তিশালী ব্যাটারি দিয়েছে দক্ষিণ কোরিয়ার এই প্রযুক্তি পণ্য নির্মাতা প্রতিষ্ঠান। কোম্পানি দাবি করছে এই ফোন একবার চার্জ দিলে টানা দুই দিন চলবে। জানুন এই ফোনের বাদবাকি স্পেসিফিকেশন।\n" +
                "স্যামসাংয়ের নতুন এই ডিভাইস ৬ জিবি র\u200C্যাম ও ১২৮ জিবি স্টোরেজ দেওয়া হয়েছে। যার দাম ভারতে ১৮ হাজার ৯৯৯ রুপি। অন্যদিকে একই মডেল পাওয়া যাবে ৮ জিবি র\u200C্যাম ও ১২৮ স্টোরেজ দেওয়া হয়েছে। যার দাম ২০ হাজার ৯৯৯ রুপি।\n" +
                "এতে ৬.৪৭ ইঞ্চির ফুল এইচডি প্লাস অ্যামোলিড ডিসপ্লে দেওয়া হয়েছে। এই ডিসপ্লের সুরক্ষার জন্য গরিলা গ্লাস প্রটেকশন রয়েছে। মাল্টিটাস্কিংয়ের জন্য এক্সিনোস ১২০৮ মডেলের প্রসেসর দিয়েছে স্যামসাং।\n" +
                "এই স্মার্টফোনে ক্যামেরা রয়েছে ৫০ মেগাপিক্সেল প্রাইমারি সেন্সর সঙ্গে ৮ মেগাপিক্সেল আল্ট্রা ওয়াইড লেন্স এবং ২ মেগাপিক্সেল সেন্সর। প্রাইমারি ক্যামেরাতে পাবেন অটো নাইট মোড, ৪কে ভিডিও রেকর্ডিং ইত্যাদি। সামনে সেলফি ও ভিডিও কলের জন্য থাকছে ১৩ মেগাপিক্সেল ফ্রন্ট ক্যামেরা।\n" +
                "ব্যাকআপের জন্য হ্যান্ডসেটটিতে ৬০০০ মিলিঅ্যাম্পিয়ারের ব্যাটারি দেওয়া হয়েছে। কোম্পানি দাবি করছে একবার চার্জ দিলে দুই দিন পর্যন্ত ব্যাকআপ পাওয়া যাবে। এই ব্যাটারি চার্জ দেওয়ার জন্য ফাস্ট চার্জার রয়েছে।\n" +
                "ফোনটির চলবে অ্যানড্রয়েড ১৩ অপারেটিং সিস্টেমে। ৪ বছর গুরুত্বপূর্ণ আপডেট দেওয়া হবে এবং ৫ বছর মিলবে সিকিউরিটি আপডেট।\n" +
                "কানেক্টিভিটির ক্ষেত্রে ৫জি এবং নিরাপত্তার জন্য সাইড মাউন্টেড ফিঙ্গারপ্রিন্ট সেন্সর পাবেন ইউজাররা। বাজারে এই স্মার্টফোনটি দুইটি রঙে হাজির করেছে স্যামসাং।\n");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("title","শাওমি আনল ‘ওয়াটার গান’");
        hashMap.put("image_url","https://techzoom.tv/wp-content/uploads/2023/08/%E0%A6%B6%E0%A6%BE%E0%A6%93%E0%A6%AE%E0%A6%BF-%E0%A6%86%E0%A6%A8%E0%A6%B2-%E2%80%98%E0%A6%93%E0%A7%9F%E0%A6%BE%E0%A6%9F%E0%A6%BE%E0%A6%B0-%E0%A6%97%E0%A6%BE%E0%A6%A8.jpg");
        hashMap.put("des","চীনের উদীয়মান প্রযুক্তিপণ্য নির্মাতা প্রতিষ্ঠান শাওমি ওয়াটার গান। এটি নিছক খেলনা নয়। এর বহুবিধ ব্যবহারও রয়েছে। এটি দিয়ে ঘর-বাড়ি পরিষ্কারও করা যাবে। এমনকি পোষা প্রাণীকেও গোসল করানো যাবে। শাওমির নতুন এই ডিভাইসটির নাম মিজিয়া পালস ওয়াটার গান।\n\n" +
                "শাওমি বাজারে ভিন্ন ধরনের গ্যাজেট তৈরি করেছে। স্নিকার্স থেকে শুরু করে ভ্যাকুম ক্লিনার পর্যন্ত, তাদের বিস্তৃত প্রোডাক্ট ক্যাটেগরিতে কী নেই! সেই কোম্পানিই এবার ফ্যান্সি টয় গান বিক্রি করছে, যা দেখতে সাই-ফাই ছবির থেকে কোনও অংশে কম নয়।\n\n" +
                "ওয়াটার গানটিতে বেশ কিছু আকর্ষণীয় ফিচার রয়েছে। যা আনন্দদায়ক এবং যথেষ্ট প্র্যাক্টিক্যালও বটে। পানির নিচে ভিডিও রেকর্ড করতে পারে ডিভাইসটি। তিনটি মোড রয়েছ এতে। এগুলো হলো- কন্টিনিউয়াস, সিঙ্গেল এবং চার্জড।\n\n" +
                "ডিভাইসটির সর্বাধিক স্পিড ২৫ ওয়াটার বম্ব প্রতি সেকেন্ড এবং রেঞ্জ ৭-৯ মিটার পর্যন্ত। এটি নিজেকেই স্বয়ংক্রিয়ভাবে রিফিল করতে পারে যেকোনো সোর্স থেকে ১০-১৫ সেকেন্ডের মধ্যে পানি শোষণ করে। হাই-ডেফিনিশন ট্যাক্টিক্যাল ডিসপ্লে রয়েছে এতে, যা রিয়্যাল টাইম ভিত্তিতে মোড এবং স্টেটাস দেখাতে পারে।\n\n" +
                "ক্লিনিংয়ের কাজেও লাগতে পারে এই গ্যাজেটটি।। আপনার গাড়ি পরিষ্কার করতে পারেন এটি দিয়ে। সেই সঙ্গেই আবার ঘরের দরজা-জাোলা থেকে শুরু করে ফ্লোর এমনকি আপনার পোষ্যকেও পরিষ্কার করতে পারেন এই ডিভাইসের সাহায্যে।\n\n" +
                "ডিভাইসটিতে রয়েছে ৮০০ মিলিঅ্যাম্পিয়ারের লিথিয়াম আয়ন ব্যাটারি। যা ১০ ওয়াট চার্জিং সাপোর্ট করে। একটি ইউএসবি টাইপ সি চার্জিং পোর্টের মাধ্যমে গ্যাজেটটি চার্জ করা যাবে। একবার চার্জে ৪০ মিনিট পর্যন্ত ব্যাকআপ দিতে পারে খেলনা পিস্তলটি।\n\n");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("title","যেসব অ্যাপ ব্যবহার করলে ফোনের তথ্য চুরি হতে পারে");
        hashMap.put("image_url","https://techzoom.tv/wp-content/uploads/2023/04/%E0%A6%B8%E0%A7%8D%E0%A6%AE%E0%A6%BE%E0%A6%B0%E0%A7%8D%E0%A6%9F%E0%A6%AB%E0%A7%8B%E0%A6%A8-%E0%A6%A5%E0%A7%87%E0%A6%95%E0%A7%87-%E0%A6%A4%E0%A6%A5%E0%A7%8D%E0%A6%AF-%E0%A6%9A%E0%A7%81%E0%A6%B0%E0%A6%BF-%E0%A6%95%E0%A6%B0%E0%A6%9B%E0%A7%87-%E0%A6%AE%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%B2%E0%A6%93%E0%A7%9F%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%B0%E0%A6%AF%E0%A7%81%E0%A6%95%E0%A7%8D%E0%A6%A4-%E0%A7%AC%E0%A7%A6-%E0%A6%85%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%AA.webp");
        hashMap.put("des","তথ্য প্রযুক্তির বিপ্লবের এই সময়ে জীবনকে সহজ করে তুলতে মোবাইল ফোনের ভূমিকা অতুলনীয়। বিনোদন থেকে শুরু করে ব্যাংকিং লেনদেন, সবই এখন হাতের মুঠোয়। বিভিন্ন কাজের জন্য আমরা অসংখ্য অ্যাপ ইন্সটল করে থাকি। কিন্তু কখনো ভেবে দেখেছেন, এসব অ্যাপের মাধ্যমে আপনার ফোনের গুরুত্বপূর্ণ তথ্য চুরি হতে পারে?\n" +
                "কিছু সাইবার অপরাধী ফোনের বিভিন্ন তথ্য চুরি করতে কিছু লোভনীয় ফিচার সমৃদ্ধ অ্যাপ তৈর করে তা ইন্টারনেটে ছড়িয়ে দেও। গুগলের প্লে স্টোর বা অ্যাপলের অ্যাপ স্টোরেও এ ধরনের অ্যাপ পাওয়া যায়।\n" +
                "বিভিন্ন আকর্ষণীয় ফিচার ব্যবহারের লোভে অনেকে তেমন কিছু না ভেবেই ফোনে এসব অ্যাপ ইন্সটল করে ফেলেন। এসব অ্যাপ আপনার জন্য হয়ে উঠতে পারে মারাত্মক বিপদের কারণ। সাইবার নিরাপত্তা বিশেষজ্ঞরা জানিয়েছেন, হ্যাকাররা প্লে স্টোরের অ্যাপে ট্রোজান, অ্যাডওয়্যার, স্পাইওয়্যার ও বিভিন্ন ম্যালওয়্যার প্রোগ্রাম আপলোড করছে, যা ফোনের ডেটা চুরি করতে সক্ষম। বেশকিছু সাইবার সিকিউরিটি বিষয়ক জার্নালে বলা হয়েছে অ্যান্ড্রয়েড স্মার্টফোনগুলো গত ১ দশকে ধরে সাইবার অপরাধীদের প্রধান টার্গেটে পরিণত হয়েছে। কারণ এটি একটি ওপেন সোর্স প্রোগ্রাম ও সহজেই পরিবর্তন করা যায়।\n" +
                "আমরা অনেকেই ব্যবহার করে থাকি এরকম বেশ কিছু জনপ্রিয় অ্যাপও ফোনের তথ্য চুরি করে থাকে। উদাহরণ হিসেবে নিচের তালিকাটি দেওয়া হল:\n\n" +
                "অ্যামেজিং ওয়ালপেপার\n" +
                "হোপ ক্যামেরা-পিকচার রেকর্ড\n" +
                "সেম লঞ্চার এবং লাইভ ওয়ালপেপার\n" +
                "কুল ইমোজি এডিটর এবং স্টিকার\n" +
                "সিম্পল নোট স্ক্যানার\n" +
                "ইউনিভার্সাল পিডিএফ স্ক্যানার\n" +
                "ব্লাড প্রেসার চেকার\n" +
                "ভ্লগ স্টার ভিডিও এডিটর\n" +
                "ওয়াও বিউটি ক্যামেরা\n" +
                "ইনস্ট্যান্ট হার্ট রেট এনিটাইম\n\n" +
                "অ্যান্ড্রয়েড ব্যবহারকারীরা গুগল প্লে স্টোরে অনেক অ্যাপের সমাহার দেখতে পান। কিন্তু, এর মধ্যে সব অ্যাপ সমান নিরাপত্তা নিশ্চিত করবে না। তাই কোনো অ্যাপ ডাউনলোড করার আগে এর রেটিং দেখা উচিৎ এবং ব্যবহারকারীদের রিভিউ পড়া উচিৎ। রিভিউ ভালো হলে তবেই ডাউনলোড করা তুলনামূলক নিরাপদ। একই ফিচারের এবং দেখতে প্রায় একই রকম অ্যাপ পেতে পারেন প্লে স্টোরে। সেক্ষেত্রে যে অ্যাপটি সবচেয়ে বেশি ডাউনলোড হয়েছে সেটি বেছে নিতে পারেন এবং অবশ্যই রেটিং ও রিভিউ দেখে নিতে ভুলবেন না।\n");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("title","তিন চাকার বৈদ্যুতিক সাইকেল এলো বাজারে");
        hashMap.put("image_url","https://techzoom.tv/wp-content/uploads/2023/08/%E0%A6%A4%E0%A6%BF%E0%A6%A8-%E0%A6%9A%E0%A6%BE%E0%A6%95%E0%A6%BE%E0%A6%B0-%E0%A6%AC%E0%A7%88%E0%A6%A6%E0%A7%8D%E0%A6%AF%E0%A7%81%E0%A6%A4%E0%A6%BF%E0%A6%95-%E0%A6%B8%E0%A6%BE%E0%A6%87%E0%A6%95%E0%A7%87%E0%A6%B2-%E0%A6%8F%E0%A6%B2%E0%A7%8B-%E0%A6%AC%E0%A6%BE%E0%A6%9C%E0%A6%BE%E0%A6%B0%E0%A7%87.jpg");
        hashMap.put("des","জ্বালানি তেলের দাম বৃদ্ধি এবং পরিবেশ দূষণ কমাতে সবাই বৈদ্যুতিক যান তৈরিতে ঝুঁকছে। এরই মধ্যে অনেক দেশেই চালু হয়েছে বৈদ্যুতিক গাড়ি, বাইক, স্কুটারের ব্যবহার। ইউরোপের অনেক দেশেই বৈদ্যুতিক গাড়ি বাধ্যতামূলক করা হচ্ছে।\n\n" +
                "সাইকেল যদিও পরিবেশবান্ধব তারপরও ব্যবহারের সুবিধায় বৈদ্যুতিক সাইকেল দিন দিন জনপ্রিয় হচ্ছে। কিছুদিন আগেই টাটা নিয়ে এসেছে তাদের বৈদ্যুতিক সাইকেল। এবার একটি বৈদ্যুতিক সাইকেল বাজারে এসছে যারা চাকা দুটি নয় তিনটি। চেহারায় বেশ আকর্ষণীয় এই বৈদ্যুতিক সাইকেলের নাম ভাইরিবাস ট্রাইক।\n\n" +
                "শক্তি উৎপাদনের জন্য রয়েছে ৩৫ভি ১০এএইচ ব্যাটারি। ফ্রন্ট হুইলে রয়েছে ২৫০ ওয়াট মোটর। এটির হাব মোটরের সর্বোচ্চ আউটপুট ৫০০ ওয়াট। সংস্থার দাবি, একবার ফুল চার্জে টানা ৪৮ কিলোমিটার ঘোরা যাবে। ঘণ্টায় ২৪ কিলোমিটার চলতে পারে সাইকেলটি। সাইকেলের যে ব্যাটারি রয়েছে তা ফুল চার্জ হতে সময় নেয় ৪ থেকে ৬ ঘণ্টা।\n\n" +
                "আরাম করে পা রাখার জন্য রয়েছে থাম্ব থ্রটেল। ওজনেও বেশ হালকা সাইকেলটি। মাত্র ৩২ কেজি ওজন এই বৈদ্যুতিক সাইকেলের। ২৪ ইঞ্চি এবং ২৬ ইঞ্চি-এই দু’ধরনের সাইজে পাওয়া যায় সাইকেলটি। সাইকেলের সঙ্গে আছে ৩.৫ ইঞ্চি ডিসপ্লে। মোটরসাইকেল ও স্কুটারের মতো এটির সামনেও রয়েছে এলইডি হেডলাইট।\n\n" +
                "৩ চাকার এই বৈদ্যুতিক সাইকেলটি ৬টি রঙের বিকল্পে পাওয়া যাবে। এরই মধ্যে ইউরোপ, আমেরিকার একাধিক দেশে বেশ জনপ্রিয় হয়ে উঠেছে এই সাইকেল। তবে ভারতে বা বাংলাদেশে কবে আসবে এই সাইকেল তা জানা যায়নি। চাইলে ই-কমার্স সাইট অ্যামাজনে অর্ডার করে কিনতে পারবেন সাইকেলটি। আন্তর্জাতিক বাজারে এর দাম ৮৯৯ ডলার। বাংলাদেশি মুদ্রায় ৯৭ হাজার টাকা।\n\n");
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("title","অনলাইনে আপনার ব্যক্তিগত তথ্য পেলে জানাবে গুগল");
        hashMap.put("image_url","https://techzoom.tv/wp-content/uploads/2023/06/%E0%A6%AB%E0%A7%8B%E0%A6%A8%E0%A7%87%E0%A6%B0-%E0%A6%AC%E0%A7%8D%E0%A6%AF%E0%A6%95%E0%A7%8D%E0%A6%A4%E0%A6%BF%E0%A6%97%E0%A6%A4-%E0%A6%A4%E0%A6%A5%E0%A7%8D%E0%A6%AF.jpg");
        hashMap.put("des","নিত্যনতুন ফিচার নিয়ে আসছে গুগল। গত বছর সেপ্টেম্বরে নিয়ে এসেছিল তেমনই একটি ফিচার ‘রেজাল্ট অ্যাবাউট ইউ’। অনলাইনে আপনার কি কি তথ্য আছে সে তথ্য জানাতেই এই ফিচারে নিয়ে আসা হয়। এবার সেই ড্যাশবোর্ড আপডেট করে নতুন ফিচার যোগ করেছে গুগল।\n" +
                "\n" +
                "চারদিকে ব্যক্তিগত তথ্য ফাঁস নিয়ে যখন এতো হইচই তখন সেই ব্যক্তিগত তথ্যে খোঁজ জানাবে এই ফিচার। এই ড্যাশবোর্ডে নিজের নাম-পরিচয় দিলে সে নিজেই খোঁজার কাজটি করে দেবে। যে সব ওয়েবসাইটে এই সংক্রান্ত তথ্য রয়েছে, সেগুলো আপনার সামনে তুলে ধরা হবে। এবার আপনি সেই ওয়েব পেজগুলোতে গিয়ে দেখে নিতে পারবেন কোন তথ্য ফাঁস হয়ে গেছে। সঙ্গে সঙ্গে তা মুছে দেয়ার আবেদনও করে দিতে পারবেন।\n" +
                "\n" +
                "আগে কোনও ওয়েবসাইটে ব্যক্তিগত তথ্য খুঁজে পাওয়া গেলে তা সরিয়ে দেয়ার জন্য ম্যানুয়ালি আবেদন করতে হতো। যার ফলাফল পেতে অনেক সময় লাগতো। কিন্তু প্রযুক্তির উন্নতির সঙ্গে নিজেকেও আপডেট করেছে গুগল।\n" +
                "\n" +
                "এখন কোনো ওয়েবসাইটে আপনার ঠিকানা, ফোন নম্বর কিংবা ই-মেইল আইডি খুঁজে পাওয়া গেলে নোটিফিকেশনের মাধ্যমে তা আপনাকে নিজেই জানিয়ে দেবে গুগল। ফলে সহজেই আপনি তা মুছে ফেলার সুযোগ পাবেন।\n" +
                "\n" +
                "এতে ব্যক্তিগত তথ্য সুরক্ষিত থাকবে বলে দাবি গুগলের। প্রতারণার হাত থেকেও নিরাপদ থাকা যাবে। প্রাথমিক ভাবে এই ফিচার মার্কিন যুক্তরাষ্ট্রে চালু হয়েছে। খুব শিগগিরই এটি একাধিক ভাষায় চালু করা হবে।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("title", "হার্ডওয়্যার আপগ্রেড সত্ত্বেও চ্যালেঞ্জে পড়তে পারে আইফোন ১৫");
        hashMap.put("image_url","https://techzoom.tv/wp-content/uploads/2023/08/%E0%A6%B9%E0%A6%BE%E0%A6%B0%E0%A7%8D%E0%A6%A1%E0%A6%93%E0%A6%AF%E0%A6%BC%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%B0-%E0%A6%86%E0%A6%AA%E0%A6%97%E0%A7%8D%E0%A6%B0%E0%A7%87%E0%A6%A1-%E0%A6%B8%E0%A6%A4%E0%A7%8D%E0%A6%A4%E0%A7%8D%E0%A6%AC%E0%A7%87%E0%A6%93-%E0%A6%9A%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%B2%E0%A7%87%E0%A6%9E%E0%A7%8D%E0%A6%9C%E0%A7%87-%E0%A6%AA%E0%A7%9C%E0%A6%A4%E0%A7%87-%E0%A6%AA%E0%A6%BE%E0%A6%B0%E0%A7%87-%E0%A6%86%E0%A6%87%E0%A6%AB%E0%A7%8B%E0%A6%A8-%E0%A7%A7%E0%A7%AB.jpg");
        hashMap.put("des","আগামী কয়েক সপ্তাহের মধ্যেই অ্যাপলের কথিত পরবর্তী প্রজন্মের স্মার্টফোন আইফোন ১৫ উন্মোচন করা হবে বলে আশা করা হচ্ছে। তবে বড় ধরনের আপডেট থাকা সত্ত্বেও অ্যাপলকে এবার একটি কঠিন স্মার্টফোন বাজারের মধ্যে চ্যালেঞ্জের মুখে পড়তে হবে। খবর গ্যাজেটস ৩৬০।\n" +
                "আইফোন ১৫ মডেলটিকে ২০২০ সালে আইফোন ১২ উন্মোচনের পর থেকে এ সিরিজের প্রথম বড় ধরনের আপগ্রেড হিসেবে বিবেচনা করা হয়। নতুন এ মডেলে ডিসপ্লেতে আপগ্রেড, চার্জিং পোর্ট এবং দ্রুতগতির প্রসেসর থাকতে থাকতে পারে। আর আইফোন ১৫ প্রো মডেলে আরো টেকসই টাইটানিয়াম ফ্রেম থাকতে পারে। এর ডিসপ্লে বেজেল আরো সরু হতে পারে।\n" +
                "নিজের সাপ্তাহিক পাওয়ার অন নিউজলেটারে ব্লুমবার্গের মার্ক গুরম্যান উল্লেখ করেছেন, অ্যাপল অবশেষে স্বীকার করেছে যুক্তরাষ্ট্রে গত কয়েক ত্রৈমাসিক ধরে স্মার্টফোনের বাজার পতনশীল অবস্থায় রয়েছে। ফলে নতুন আইফোন ১৫ সিরিজ কেনার ব্যাপারে সম্ভাব্য ক্রেতাকে আকৃষ্ট করতে তাদের আরো কিছু করতে হবে। নতুন সিরিজে আইফোন ১৫, আইফোন ১৫ প্লাস, আইফোন ১৫ প্রো এবং আইফোন ১৫ প্রো ম্যাক্স মডেলগুলো থাকবে বলে জানা গেছে।\n" +
                "আগের প্রতিবেদন অনুযায়ী, আইফোন ১৫ এবং আইফোন ১৫ প্লাস মডেলে আপগ্রেড ক্যামেরাসহ গত বছরের আইফোন ১৪ প্রো মডেলের এ১৬ বায়োনিক চিপ এবং ডায়নামিক আইল্যান্ড থাকবে। অন্যদিকে আইফোন ১৫ প্রো এবং আইফোন ১৫ প্রো ম্যাক্সে একটি নতুন টাইটানিয়াম চ্যাসিস থাকবে, যা আরো টেকসই হবে। এছাড়া একটি ৩এনএম চিপসেট থাকবে গত বছরের মডেলগুলোর তুলনায় যেটি হবে অনেক দ্রুতগতির।\n" +
                "গুরম্যানের ভাষ্য অনুযায়ী, বাজার সংকোচন অ্যাপলের জন্য বড় ধরনের প্রতিবন্ধকতা হয়ে উঠতে পারে। কোম্পানিটির স্মার্টফোন বাজার অর্থনৈতিক মন্থরতার কারণে বেশ ভুগেছে।\n" +
                "অ্যাপলের প্রকাশিত তথ্য অনুযায়ী, চলতি বছরের দ্বিতীয় প্রান্তিকে আইফোন বিক্রি কমেছে ২ দশমিক ৪ শতাংশ।\n");

        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("title","ইউএসবি টাইপ-সি চার্জার বাধ্যতামূলক করছে সৌদি");
        hashMap.put("image_url","https://techzoom.tv/wp-content/uploads/2023/08/%E0%A6%87%E0%A6%89%E0%A6%8F%E0%A6%B8%E0%A6%AC%E0%A6%BF-%E0%A6%9F%E0%A6%BE%E0%A6%87%E0%A6%AA-%E0%A6%B8%E0%A6%BF-%E0%A6%9A%E0%A6%BE%E0%A6%B0%E0%A7%8D%E0%A6%9C%E0%A6%BE%E0%A6%B0-%E0%A6%AC%E0%A6%BE%E0%A6%A7%E0%A7%8D%E0%A6%AF%E0%A6%A4%E0%A6%BE%E0%A6%AE%E0%A7%82%E0%A6%B2%E0%A6%95-%E0%A6%95%E0%A6%B0%E0%A6%9B%E0%A7%87-%E0%A6%B8%E0%A7%8C%E0%A6%A6%E0%A6%BF.jpg");
        hashMap.put("des","স্মার্টফোনের চার্জার হিসেবে ইউএসবি টাইপ-সি চার্জার বাধ্যতামূলক করার সিদ্ধান্ত নিয়েছে সৌদি আরব। নতুন এ সিদ্ধান্ত ২০২৫ সালের ১ জানুয়ারি থেকে কার্যকর হবে। ফোনের পাশাপাশি ইলেকট্রনিক ডিভাইসের ক্ষেত্রেও এটি প্রযোজ্য হবে। চার্জিং পোর্ট মানসম্মত করার সরকারি সিদ্ধান্তের অংশ হিসেবে এ পদক্ষেপ নেয়া হয়েছে। খবর সৌদি গেজেট।\n" +
                "সৌদি স্ট্যান্ডার্ডস, মেট্রোলজি অ্যান্ড কোয়ালিটি অর্গানাইজেশন এবং কমিউনিকেশন, স্পেস অ্যান্ড টেকনোলজি কমিশনের পক্ষ থেকে মোবাইল ফোন এবং ইলেকট্রনিক ডিভাইসের জন্য একক চার্জিং পোর্ট বাধ্যতামূলক করার এ ঘোষণা দেয়া হয়েছে।\n" +
                "এ সিদ্ধান্তের লক্ষ্য হিসেবে ব্যবহারকারীদের অভিজ্ঞতার উন্নয়ন এবং বাড়তি খরচ এড়ানোর কথা বলা হয়েছে। এছাড়া ডাটা স্থানান্তর প্রযুক্তির পাশাপাশি এটি ইলেকট্রনিক বর্জ্যের পরিমাণ কমিয়ে আনবে, যা পরিবেশের জন্য ইতিবাচক। সৌদি আরবে সেলফোন এবং ইলেকট্রনিক ডিভাইসের জন্য বার্ষিক ২২ লাখ ইউনিটের বেশি চার্জার এবং চার্জিং কেবল ব্যবহার করা হয়। নতুন এ সিদ্ধান্তের ফলে এর ব্যবহার কমে আসবে। এতে করে বার্ষিক প্রায় ১৫ টন ইলেকট্রনিক বর্জ্য হ্রাস পাবে। ব্যবহারকারীদের ১৭ কোটিরও বেশি সৌদি রিয়ালের সাশ্রয় হবে।\n" +
                "সরকারের নতুন এ সিদ্ধান্তের বাধ্যতামূলক প্রয়োগ দুই ধাপে কার্যকর হবে। এর প্রথম ধাপটি শুরু হবে ২০২৫ সালের ১ জানুয়ারি। এতে সেলফোন, ট্যাব, ডিজিটাল ক্যামেরা, ই-রিডার, পোর্টেবল ভিডিও গেম ডিভাইস, হেডফোন, অ্যামপ্লিফায়ার, কি-বোর্ড, মাউস অন্তর্ভুক্ত থাকবে। দ্বিতীয় ধাপটি শুরু হবে ২০২৬ সালের ১ এপ্রিল। এ ধাপে ল্যাপটপে টাইপ-সি কেবল ব্যবহার বাধ্যতামূলক করা হবে।\n");
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("title","এমথ্রি ম্যাক মিনি নিয়ে কাজ করছে অ্যাপল!");
        hashMap.put("image_url","https://techzoom.tv/wp-content/uploads/2023/08/%E0%A6%85%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%AA%E0%A6%B2.jpg");
        hashMap.put("des","যুক্তরাষ্ট্রভিত্তিক প্রযুক্তি প্রতিষ্ঠান অ্যাপল শিগগিরই তার পরবর্তী প্রজন্মের এমথ্রি প্রসেসর উন্মোচন করবে বলে আশা করা হচ্ছে। এ চিপসেট ব্র্যান্ডটির বিভিন্ন পণ্যের সঙ্গে যুক্ত হবে। এগুলোর মধ্যে একটি হতে পারে নতুন ম্যাক মিনি পিসি।\n" +
                "প্রতিবেদনে বলা হয়েছে, অ্যাপল পিসিটিতে একটি এইট-কোর সিপিইউ এবং একটি টেন-কোর সিপিইউ থাকবে। এ চিপসেট ২৪ জিবি র\u200D্যামের সঙ্গে যুক্ত হবে। স্পেসিফিকেশন অনুযায়ী, এমটু চালিত ম্যাক মিনির বেজ মডেলের সঙ্গে এটির বেশ মিল রয়েছে।\n" +
                "যদিও বেজ মডেলটিতে মাত্র ৮ জিবি র\u200D্যাম রয়েছে। তাই নতুন ম্যাক মিনিতে উচ্চতর বেজ স্টোরেজ থাকতে পারে। এ খবর সত্য হলে অ্যাপল বেশ কয়েকটি এমথ্রি ম্যাক নিয়ে কাজ করছে, যার মধ্যে ম্যাকবুকও রয়েছে।\n" +
                "ব্লুমবার্গের মার্ক গুরম্যান বলেন, এ এমথ্রি ম্যাকগুলো সম্ভবত ২০২৪ সালের প্রথম আর্থিক ত্রৈমাসিকের আগে বাজারে আসবে। এটি আমাদের পূর্ববর্তী প্রতিবেদনের সঙ্গেও সংগতিপূর্ণ।\n" +
                "কোম্পানিটি ম্যাক প্রো এবং ম্যাক স্টুডিওর এমথ্রি সংস্করণ নিয়ে কাজ করছে কিনা সেটি এখনো জানা যায়নি।\n");
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("title","চীনের স্মার্টফোন বাজারে ‘এইচ১ ২০২৩’ এ ‘অপো’র শীর্ষস্থান");
        hashMap.put("image_url","https://techzoom.tv/wp-content/uploads/2023/08/%E0%A6%85%E0%A6%AA%E0%A7%8B-%E0%A6%9A%E0%A7%80%E0%A6%A8%E0%A7%87%E0%A6%B0-%E2%80%98%E0%A6%AC%E0%A7%87%E0%A6%B8%E0%A7%8D%E0%A6%9F-%E0%A6%B8%E0%A7%87%E0%A6%B2%E0%A6%BF%E0%A6%82-%E0%A6%AC%E0%A7%8D%E0%A6%B0%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%A8%E0%A7%8D%E0%A6%A1.jpg");
        hashMap.put("des","অন্যতম শীর্ষস্থানীয় গ্লোবাল স্মার্টফোন ব্র্যান্ড ‘অপো’ ‘ফাইন্ড এন২’ সিরিজ এবং  ‘ফাইন্ড এক্স৬’ সিরিজের ফ্ল্যাগশিপ মোবাইল সেটগুলোর দুর্দান্ত পারফর্ম্যান্সের ফলে একই সময়ের ব্যবধানে  ‘এইচ১ ২০২৩’ এ চীনের স্মার্টফোন বাজারে ১ম স্থান ও বিশ্বজুড়ে ৪র্থ স্থান অধিকার করে নিয়েছে।\n" +
                "ক্যানালিস এর তথ্য অনুযায়ী, ৫১ দশমিক ৯ মিলিয়ন শিপমেন্ট সহ এইচ১ এ বৈশ্বিক স্মার্টফোন বাজারে অপো এর শেয়ার ১০% এবং এইচ১ ২০২৩ এ চীনের স্মার্টফোন বাজারে এই শেয়ারের পরিমাণ ১৮% – এতে করে বছরের প্রথম অর্ধাংশেই অপো চীনের ‘বেস্ট-সেলিং’ ব্র্যান্ড হয়ে দাঁড়িয়েছে।\n" +
                "ফোল্ডেবল স্মার্টফোনের অভাবনীয় গ্রহণযোগ্যতার ফলে অপো আরো সফল ব্র্যান্ডে পরিণত হয়েছে, যা কি না এ বছরে কোম্পানিটির দ্রুত সমৃদ্ধিতে ভূমিকা রেখেছে এবং বহু সম্ভাবনার দ্বার খুলে দিয়েছে। কাউন্টারপয়েন্ট রিসার্চ অনুমান করছে- ৫৫ মিলিয়ন ইউনিটের লক্ষ্যে পৌঁছাতে ২০১৯ থেকে ২০২৫ সালের মধ্যে ফোল্ডেবল স্মার্টফোনের বিশ্বব্যাপী শিপমেন্ট ১১৪% ‘কম্পাউন্ড অ্যানুয়াল গ্রোথ রেট’ বৃদ্ধি প্রত্যাশা করা যাচ্ছে এবং এর মধ্যে শুধু ২০২২ থেকে ২০২৫ সালের মধ্যেই এই হার চারগুণ বাড়বে বলে মনে করা হচ্ছে। অপোসহ চীনা ‘ওইএম’গুলো খুব দ্রুতই ফোল্ডেবল বাজারের সাথে খাপখাইয়ে নিতে পেরেছে এবং ২০২২ সালে বাজারের ২৬% শেয়ার নিয়ে চীনের এই উত্থানেও অবদান রাখছে।\n" +
                "ক্যানালিস থেকে পাওয়া নতুন তথ্য থেকে আরো জানা যায়, চীনের ফোল্ডেবল পণ্যের বাজারে ২০২৩ সালের প্রথম প্রান্তিকে অপোর রয়েছে ৩১% সিংহভাগ শেয়ার, যার ফলে শীর্ষস্থানে থাকছে কোম্পানিটি। কাউন্টারপয়েন্ট অনুযায়ী, ২০২৩ সালের জানুয়ারি থেকে মে পর্যন্ত চীনের মোট ফোল্ডেবল স্মার্টফোন বিক্রয়ের ১৫%-ই হচ্ছে অপোর এই ফ্ল্যাগশিপ ফোনটির, যার ফলে বাজারের অন্য সব ফোল্ডেবল পণ্যকে ছাড়িয়ে গেছে ‘ফ্লিপ’। তুলনামূলক বড় আকারের কভার স্ক্রিন সহ প্রথম ভার্টিক্যাল ফ্লিপ ফোন হিসেবে  ‘ফাইন্ড এন২ ফ্লিপ’কে দৈনন্দিন ব্যবহারের কার্যকারিতা ও উপভোগ্যতা, উভয় দিক মাথায় রেখেই ডিজাইন করা হয়েছে– অন্যসব ‘ইন্ডাস্ট্রি-সেরা’ উদ্ভাবন ছাড়াও এতে রয়েছে একটি ‘লেস-ভিজিবল ক্রিজ’, উচ্চক্ষমতার ব্যাটারি এবং ‘ইনটিউটিভ’ ইউআই ডিজাইন। ক্যানালিস থেকে জানা যায়, এসব উদ্ভাবন এবং  ‘ফাইন্ড এন২ ফ্লিপ’ এর বাণিজ্যিক সাফল্যের মাধ্যমে এ বছর বিশ্বব্যাপী ফোল্ডেবল পণ্যের বাজারেও অপো অন্য সবাইকে ছাড়িয়ে গেছে, ফলে এর মার্কেট শেয়ার ২০২২ সালের প্রথম প্রান্তিক এর ৫% থেকে ২০২৩ সালের প্রথম প্রান্তিকে এসে দাঁড়িয়েছে ১৩% এ।\n" +
                "ফোল্ডেবল স্মার্টফোনের বাজারকে সমৃদ্ধ করে  ‘অপো’ তার শক্ত অবস্থান ধরে রেখেছে এবং প্রযুক্তিগত উদ্ভাবন এর মাধ্যমে ‘ইউজার এক্সপিরিয়েন্স’ কে আরো উন্নত করতে ধারাবাহিকভাবে কাজ করে যাচ্ছে।\n");
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("title", "নাথিং ফোনের মতো দেখতে স্মার্টফোন আনল ইনফিনিক্স!");
        hashMap.put("image_url","https://techzoom.tv/wp-content/uploads/2023/08/%E0%A6%A8%E0%A6%BE%E0%A6%A5%E0%A6%BF%E0%A6%82-%E0%A6%AB%E0%A7%8B%E0%A6%A8%E0%A7%87%E0%A6%B0-%E0%A6%AE%E0%A6%A4%E0%A7%8B-%E0%A6%A6%E0%A7%87%E0%A6%96%E0%A6%A4%E0%A7%87-%E0%A6%B8%E0%A7%8D%E0%A6%AE%E0%A6%BE%E0%A6%B0%E0%A7%8D%E0%A6%9F%E0%A6%AB%E0%A7%8B%E0%A6%A8-%E0%A6%86%E0%A6%A8%E0%A6%B2-%E0%A6%87%E0%A6%A8%E0%A6%AB%E0%A6%BF%E0%A6%A8%E0%A6%BF%E0%A6%95%E0%A7%8D%E0%A6%B8.jpg");
        hashMap.put("des","আলোচিত স্মার্টফোন কোম্পানি নাথিং। প্রতিষ্ঠানটি নাথিং ফোন ১ এবং ২ মডেল বাজারে বিক্রি করছে। এই ফোনের ব্যাক প্যানেল অন্য সব ফোন থেকে আলাদা। অনেকটাই স্বচ্ছ এই ফোনের রিয়ার ভিউ। এবার নাথিং ফোনের ব্যাকপ্যানেলের ডিজাইন অনুকরণ করে ফোন তৈরি করল ইনফিনিক্স। এই ফোনের মডেল ইনফিনিক্স ১০ জিটি প্রো। যা দেখতে অনেকটাই নাথিং ফোন টু মডেলের মতোই। শিগগিরই এই ফোন বাজারে আসবে।\n" +
                "ইনফিনিক্সের আসন্ন এই ফোনে ১৬ জিবি র\u200C্যাম ও ২৫৬ জিবি স্টোরেজ থাকবে। এছাড়াও এর অন্যান্য ফিচার হবে দুর্দান্ত। পেছন থেকে ফোনটি দেখতে অনেকেই নাথিং ফোন ২ মডেলের মতোই।\n" +
                "এই স্মার্টফোনে মিলবে মিডিয়াটেক ডায়মেনসিটি ৮০৫০ চিপসেট। অন্যান্য হাই-এন্ড স্মার্টফোনের মতোই এতে থাকবে অ্যামোলিড ডিসপ্লে সঙ্গে ১২০ হার্টজ রিফ্রেশ রেট।\n" +
                "এক রিপোর্টে দাবি করা হয়েছে, এই ফোনে পাওয়া যেতে পারে ৭০০০ মিলিঅ্যাম্পিয়ারের বিশাল ব্যাটারি প্যাক। যদিও এই তথ্য যতক্ষণ না সংস্থার তরফে বলা হচ্ছে ততক্ষণ পর্যন্ত নিশ্চিত করা যাচ্ছে না। ক্যামেরার ক্ষেত্রে এতে মিলবে ১০৮ মেগাপিক্সেল প্রাইমারি ক্যামেরা সঙ্গে দুইটি ৮ মেগাপিক্সেল ক্যামেরার সাপোর্ট।\n" +
                "আরও জানা গিয়েছে, এই ফোনে পাবেন পাঞ্চ-হোল ডিসপ্লে। সুপার পাওয়ারফুল ব্যাটারির পাশাপাশি এতে সুপার ফাস্ট চার্জিং সাপোর্টও দেখা যেতে পারে। ১৬০ ওয়াট অথবা ২৬০ ওয়াট চার্জিং নিয়ে আসতে পারে ইনফিনিক্স জিটি ১০ প্রো। অপারেটিং সিস্টেমের ক্ষেত্রে এতে মিলবে অ্যানড্রয়েড ১৩ বা ১৪।\n" +
                "উপরোক্ত ফিচার্স বাদে আপাতত আর কিছু জানা যায়নি। এই দুর্ধর্ষ স্মার্টফোনের জন্য আরও কিছুদিন অপেক্ষা করতে হবে ইউজারদের। আগামী কয়েক সপ্তাহের মধ্যে দেখা দিতে পারে এই ৫জি হ্যান্ডসেট। ফ্লিপকার্টে ফোনের টিজার প্রকাশ করা হলেও এটির দাম সম্পর্কে এখনও স্পষ্ট ধারণা পাওয়া যায়নি।\n" +
                "এই ফোন বাজারে না এলেও এর ডিজাইন নিয়ে নেটদুনিয়ায় চর্চা চলছে। ইনফিনিক্স জিটি ১০ প্রোর এর ব্যাক প্যানেল যে নাথিং ফোনের মতো চলেছে তার খবর সংস্থার সিইও কার্ল পেই-এর কানে পৌছতেই অবাক তিনি। টুইট করে নাথিং প্রধান লেখেন, উকিল প্রস্তুত করার সময় চলে এসেছে। সঙ্গে একটি হাসির ইমজি দেন।\n" +
                "উল্লেখ্য শুধু ইনফিনিক্স নয়, টেকনোও পরিকল্পনা করছে তাদের আসন্ন স্মার্টফোনে নাথিং ফোনের মতো ট্রান্সপ্যারেন্ট ডিজাইন রাখার। সেই নিয়ে ইতিমধ্যে কাজ করাও শুরু করে দিয়েছে টেকনো পোভা।\n");
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("title", "ইউটিউবে কত ভিউ হলে কত টাকা আয় হয়?");
        hashMap.put("image_url","https://techzoom.tv/wp-content/uploads/2022/11/%E0%A7%A7%E0%A7%AD-%E0%A6%B2%E0%A6%BE%E0%A6%96-%E0%A6%AD%E0%A6%BF%E0%A6%A1%E0%A6%BF%E0%A6%93-%E0%A6%A1%E0%A6%BF%E0%A6%B2%E0%A6%BF%E0%A6%9F-%E0%A6%95%E0%A6%B0%E0%A6%B2%E0%A7%8B-%E0%A6%87%E0%A6%89%E0%A6%9F%E0%A6%BF%E0%A6%89%E0%A6%AC.jpg");
        hashMap.put("des","যারা ইন্টারনেটের জন্য কনটেন্ট তৈরি করেন তাদের সবচেয়ে বেশি আয় হয় ইউটিউবে। ভিডিও শেয়ারিংয়ের এর জনপ্রিয় মাধ্যমটিতে ভিডিও আপলোড করে আয় করা সহজ। সম্প্রতি ইউটিউব ঘোষণা করেছে মাত্র ৫০০ সাবস্ক্রাইবার হলেও চ্যানেল মনিটাইজ করা যাবে।\n" +
                "\n" +
                "ইউটিউব থেকে আয়ের পুরোটাই নির্ভর করে দর্শকদের উপর। অর্থাৎ যত বেশি অ্যাডস ভিউস হবে তত বেশি আয়। এছাড়াও ইম্পেশনেও আয় রয়েছে। তবে সেটা কম।\n" +
                "\n" +
                "যারা ইউটিউব চ্যানেল খোলার কথা পরিকল্পনা করছেন তাদের মনে একটাই প্রশ্ন আসতে পারে, কতজন লোক দেখলে কেমন উপার্জন হয়? কিন্তু আয়ের সঠিক অংকাট অনেকের কাছেই অজানা। এদিকে ইউটিউবাররাও তাদের আয়ের অংকটা প্রকাশ্যে আনতে চান না। কত ভিউজ হলে কত টাকা আয় হয় সে কথা জানেন না অনেকেই।\n" +
                "\n" +
                "দর্শকদের মনে একটা ধোঁয়াশা থেকে যায় যে ইউটিউব থেকে কতটা পরিমাণ টাকা আয় করা সম্ভব। আসলে ইউটিউবের অ্যালগরিদম অনুযায়ী ভিউসের সংখ্যা হাজার পেরোলেই ইউটিউব থেকে আয় করা সম্ভব। তবে ভালোমতো উপার্জন করতে হলে কমপক্ষে এক লাখ ভিউ হওয়া দরকার।\n" +
                "\n" +
                "প্রতি হাজার ভিউতে ইউটিউবের তরফে ১ থেকে ২৫ ডলার পর্যন্ত আয় করা সম্ভব। তবে গড় আয় ১৪ ডলার। এখন প্রশ্ন হল, আয়ের পরিমাণ সমান নয় কেন? আসলে ইউটিউবের ভিডিওতে কোন ধরনের অ্যাডস আসছে, তার উপর আয় নির্ভর করে। যদি কোনও ভালো বা দামি ব্র্যান্ডের অ্যাডস দেখানো হয়, তাহলে অন্যান্য অ্যাডসের তুলনায় অনেক বেশি উপার্জন করা যায়।");
        arrayList.add(hashMap);



    }



}